app/controllers/fibs_controller.rb

SELECT "fibs".* FROM "fibs"
---
  def index
    @fibs = Fib.all

INSERT INTO "fibs" ("max_number", "sequence", "created_at", "updated_at", "squares") VALUES (?, ?, ?, ?, ?)  [["max_number", 12], ["sequence", "0,1,1,2,3,5,8,13,21,34,55,89"], ["created_at", "2018-03-29 19:24:40.624637"], ["updated_at", "2018-03-29 19:24:40.624637"], ["squares", 12816]]
---
  def create
    @fib = Fib.new(fib_params)

    respond_to do |format|
      if @fib.generate && @fib.save

UPDATE "fibs" SET "max_number" = ?, "sequence" = ?, "squares" = ?, "updated_at" = ? WHERE "fibs"."id" = ?  [["max_number", 14], ["sequence", "0,1,1,2,3,5,8,13,21,34,55,89,144,233"], ["squares", 87841], ["updated_at", "2018-03-29 19:44:32.862759"], ["id", 23]]
---
  def update
    respond_to do |format|
      if @fib.update_attributes(fib_params)

DELETE FROM "fibs" WHERE "fibs"."id" = ?  [["id", 2]]
---
  def destroy
    @fib.destroy

SELECT  "fibs".* FROM "fibs" WHERE "fibs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_fib
    @fib = Fib.find(params[:id])